{
  "v1": {
    "username": "adrianquester",
    "profileUrl": "https://www.linkedin.com/in/adrianquester/",
    "fullName": "Adrian Quester",
    "headline": "I do marketing | Sometimes communications | Winner of awards | Average cook | Often cycling",
    "about": "I turn education marketing from ‘nice ideas’ into income. Or even any marketing! \n\nFor over 20 years, I’ve led marketing, communications, recruitment and enrolment functions across some of the UK’s largest and most complex education institutions, including Imperial College, the University of London (full federation of colleges), New City College, United Colleges Group, and many many more.\n\nI’ve managed teams of 70+, rebuilt departments mid-merger, delivered record-breaking campaigns, and helped institutions climb from the bottom of national league tables to multi-year growth and financial stability. My work has added £millions in income via OFS, ESFA and AEB revenue streams.\n\nHighlights? Let’s go:\n\n• Rebranded Imperial College Business School while its namesake was in court for the world’s largest hedge fund fraud.\n\n• Handled PR during the UK’s largest leasehold service charge increase at Lambeth Living Ltd.\n\n• Led United Colleges Group (City of Westminster College and College of North West London) from underperforming to outstanding financially, surpassing enrolment targets for seven consecutive years. One of only three colleges in country to achieve this level of growth.\n\n• Led on merger work streams at City of Westminster College, College of North West London, New City College and BSix College.\n\n• Won national creative awards, even beating commercial brands, for campaigns that increased applications 15x above national average.\n\n• Was integral in bringing in £110m of income last year. \n\nWhat I actually do is fix what’s broken, sharpen what’s dull, and grow what’s working, fast. Whether it’s overhauling a website, aligning brand and curriculum, stabilising HE recruitment, or leading stakeholder comms through a crisis, I’m the person institutions call when something serious needs to happen.\n\nI’ve worked in HE, FE, housing, regeneration, and internationally. I get strategy, I build teams, and I care deeply about how students experience the journey from first click to classroom.\n\nIf your enrolment needs turning around, your comms function’s lost its edge, or your marketing’s stopped making money, get in touch.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4E16AQHinkgb4YLgRA/profile-displaybackgroundimage-shrink_350_1400/B4EZjfHV2AHgAY-/0/1756089901712?e=1758758400&v=beta&t=l5R1cQWqtyLdAs_77_I02wBajzrGQcoLoyjo0s8t4gA",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4E03AQG-HWNAyI8dgQ/profile-displayphoto-crop_800_800/B4EZjNhmmbGwAM-/0/1755794795357?e=1758758400&v=beta&t=wqK7o330vDMzWQrjD2is5baBmKZbVq0QDrvJ8sGCPxk",
    "scrapedAt": "2025-08-26T00:06:23.904Z"
  }
}