{
  "v1": {
    "username": "asadbukhory",
    "profileUrl": "https://www.linkedin.com/in/asadbukhory/",
    "fullName": "Asad Bukhory",
    "headline": "Founder | Artizan Governance | Transforming Regulatory Challenges Into Strategic Growth Opportunities",
    "about": "After spending 20 years in the global fund industry, working across Africa, Asia and Europe, I launched Artizan Governance to help asset managers transform regulatory challenges into strategic growth opportunities.\n\nPreviously I held leadership roles at leading Fund Administrators and Asset Managers, including serving as COO/CCO for one of China's largest asset manager ($150+ billion AUM) overseeing operations, distribution and GRC.\n\nPrior to that I held a leadership position at a leading US asset manager.\n\nMore recently, I pioneered securitisation and tokenisation of litigation funding receivables at a start up fund manager. \n\nAs a former Board member responsible for GRC, I bring strong insights into global capital markets and cross-border fund operations.\n\nAt Artizan Governance, our value proposition includes:\n\n1. Non-Executive Director (NED) Services: Leveraging our regulatory expertise and operational leadership, we provide independent board oversight with bespoke governance support. We help drive better decision-making, improve board dynamics, and turn governance from a box-ticking exercise into a competitive edge.\n\n2. Outsourced Compliance Services: Board level expertise for first-time/emerging managers who do not need full time compliance resources. As fractional CCO/MLRO we handle all aspects of daily compliance allowing managers to focus on generating alpha.\n\n3. Advisory Services: Comprehensive FCA/PRA Authorisation, Fund launch support including full project management, Designing policies and procedures, Drafting regulatory documents such as ICAAPs, ILAAPs, ICARA that actually get approved, regulatory reporting and training solutions. \n\nWhat sets us apart is our consultative, client-centric approach: we calibrate solutions to your unique needs\n\nOur Ideal Partners:\n\n* New/Emerging Managers looking for comprehensive regulatory support without the deep pockets for a full time compliance resource.\n* Fund boards looking for a NED with cross border regulatory and operational expertise.\n* Fintech entrepreneurs looking for experienced operators with a deep understanding of innovation in regulated environments.\n\nIf you need a partner who has built and scaled GRC functions at the highest level, that’s us. \n\nArtizan Governance turns GRC challenges into strategic growth opportunities.\n\nReady to work with someone who's actually been there?\n\nBook a call - https://cal.com/artizangovernance/30min?overlayCalendar=true\n\nOr email us at enquiries@artizangovernance.com",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4E16AQGRWoZaEoBSXw/profile-displaybackgroundimage-shrink_350_1400/B4EZgx9hbJGcAc-/0/1753184876946?e=1759968000&v=beta&t=iHDdE0HVeFAg1UUiF_gMmSqsHSARo7mSsLaaF3o764M",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/C5603AQE5y0D9CuANsg/profile-displayphoto-shrink_800_800/profile-displayphoto-shrink_800_800/0/1563266013911?e=1759968000&v=beta&t=LH2LIwseQeANCOr6IW7sASA_wrgelu258Y_reII7noU",
    "scrapedAt": "2025-09-03T23:47:35.422Z"
  }
}