{
  "v1": {
    "username": "batmandesigns",
    "profileUrl": "https://www.linkedin.com/in/batmandesigns/",
    "fullName": "Faizan Bin Qaiser",
    "headline": "I help leadership coaches boost LinkedIn engagement 5x with premium carousels.",
    "about": "You are a leadership coach.\n\nYou've got 10K+ followers. Your coaching business is doing well offline. But when you post a carousel on LinkedIn? You get only 20 to 30 likes. \n\nMeanwhile, you're watching Chris Donnelly and Will McTighe pull 1000+ likes on every single carousel they post.\n\nWhat's the difference? \n\nIt's not their expertise.\nIt's how they present it.\n\nMost leadership coaches make the same mistakes:\n\n- They use the same generic templates as everyone else\n- Their designs look like they were made in 2015\n- Their content looks unprofessional\n\nAnd here's what kills me, you spend hours writing that content. But if it doesn't look professional, people scroll right past it.\n\nLet me tell you something about LinkedIn:\nAttention is everything. And carousels are the best way to get it.\n\nHere's why they work:\n\n🟠 They stop people from scrolling\n🟠 Each slide builds curiosity for the next\n🟠 They turn complex ideas into visual stories\n🟠 LinkedIn pushes them harder than any other format\n\nWhen someone stops for your carousel, they're giving you their most precious thing - their attention. That's your moment to make an impact.\n\nSo here's what I do differently:\nI don't just make your carousels look pretty. I design them to perform.\n\nEvery slide is crafted to:\n\n🟠 Stop the scroll in the first 3 seconds\n🟠 Keep people engaged through all slides\n🟠 Position you as the authority you already are\n\nThe result isss ...\nYour content finally gets the engagement it deserves. \n\nWant carousels that perform like Chris Donnelly and Will McTighe?\n\nYou need someone who gets both design and LinkedIn psychology. \nSomeone who's studied what makes people stop scrolling.\n\nYou're already a great coach. You need your content to look like it.\nLet's grow your brand get the engagement you desire. Yayy.\n\nHit me up through my featured section or send a DM.\n\nYou can also contact me here:\nfaizanbinqaiser@gmail.com",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4D16AQEx5h782pH6hQ/profile-displaybackgroundimage-shrink_350_1400/B4DZiAKW6LGkAc-/0/1754496856864?e=1759968000&v=beta&t=_2sjtS1cE_70pVdG71YhD2cgNpJio5z3tPeXUb7vPuw",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4D03AQGJ8amGn7oYaQ/profile-displayphoto-crop_800_800/B4DZhB9oi.HAAI-/0/1753453333345?e=1759968000&v=beta&t=62Cqm1EwzuTY5U4_kU1MP6tU9wuiFhd4P-oKeY88iDs",
    "scrapedAt": "2025-09-03T07:24:00.139Z"
  }
}