{
  "v1": {
    "username": "bearbulltraders",
    "profileUrl": "https://www.linkedin.com/in/bearbulltraders/",
    "fullName": "Andrew Aziz",
    "headline": "Helping Mid-Career Pros Build Second Income Through Day Trading | Author of How to Day Trade for a Living | Peak Performance Advocate",
    "about": "Most people who try trading lose money.\n\nWhy?\n\nBecause they treat it like gambling, jump between strategies, and never build the discipline to stick to a process.\n\nI know, because that was me when I started.\n\nI had just been laid off from my engineering job. I put my severance into trading, and within months most of it was gone. But instead of walking away, I decided to figure out how to do it right.\n\nI studied the markets like an engineer. I tested strategies. I wrote down every mistake. I learned to manage risk. Slowly, trading became less like a slot machine - and more like a skill I could rely on.\n\nThat process became my first book, How to Day Trade for a Living, which went on to become an Amazon bestseller in 17 languages. It also became Bear Bull Traders, a community where traders at every level can learn together, practice, and hold each other accountable.\n\nIf you’re here, you might be:\n\n🔴 Interested in trading but unsure where to begin\n🔴 Tired of the hype and looking for someone credible\n🔴 Wanting to build a second income you can trust\n\nHere’s what I share:\n\n✅ Simple, repeatable trading strategies\n✅ Tools and systems to execute efficiently\n✅ The psychology and discipline that separates winners from losers\n\nTrading changed my life after I lost my career. Now, I spend every day teaching others how to make it a skill that can fit into their lives too.",
    "bannerImageUrl": "https://ik.imagekit.io/amicoder/bearbulltraders/v1/banner.com_dms_image_v2_D5616AQGdzj38UsGS4Q_profile-displaybackgroundimage-shrink_350_1400_B56ZmAsQGaI4AY-_0_1758800709348",
    "profileImageUrl": "https://ik.imagekit.io/amicoder/bearbulltraders/v1/profile.com_dms_image_v2_D5603AQEQrlDxvUlkYQ_profile-displayphoto-crop_800_800_B56Zf1NIySGoAI-_0_1752165551960",
    "scrapedAt": "2025-12-02T05:20:13.042Z"
  }
}
