{
  "v1": {
    "username": "bushranasrullah",
    "profileUrl": "https://www.linkedin.com/in/bushranasrullah/",
    "fullName": "Bushra N.",
    "headline": "Building & Monetizing LinkedIn™ Assets",
    "about": "Your LinkedIn isn't just lazy, it's criminally underpaid.\nThat's the dream most people are sold on LinkedIn.\n\n\"Post content and success will come\"\n\nBut as with most things in life.\n\nIt isn't that simple.\n\nMost LinkedIn users start with zero strategy, post randomly, and wonder why nothing happens.\n\nThe same thing happened to me.\n\nUntil I finally stopped treating LinkedIn like a bulletin board and started building it like a BUSINESS.\n\nMy team and I developed an entire system to transform quiet profiles into client-generating machines within weeks.\n\n(Not just \"post more often\" advice but an ACTUAL SYSTEM)\n(One where your profile works FOR you, not the other way around)\n\nI've used this system to:\n\nHelp 70+ professionals dominate LinkedIn\nGenerate 20+ MILLION impressions for clients\nBuild multiple 6-figure personal brands globally\nCreate comments reaching 300K+ impressions regularly\n\n\nWhat's killing your LinkedIn potential right now:\n\nYour brilliant ideas are dying in the algorithm\nYour profile reads like a dusty resume instead of a client magnet\nYour comments get buried when they should be goldmines\n\nI don't just fix problems - I build LinkedIn ASSETS that work while you sleep:\n\nStrategic profiles that convert visitors to clients\nComment systems that generate visibility without endless posting\nMonetization frameworks that turn connections into revenue\n\nWhether you're starting out or already posting regularly, here's how I can help:\n\nIf you're new, you'll learn how to position yourself as the go-to expert\nIf you're experienced, you'll discover systems to 10x your results with half the effort\n\nI help ambitious professionals in 3 ways:\n\n→ Strategy Sessions (fix what's broken)\n→ Asset Building Programs (create what's missing)\n→ Done-For-You Solutions (let me handle everything)\n\nReady for your LinkedIn to finally pay you what it's worth?\n\nMessage me with \"ASSETS\" to start the conversation.\n\nOr type \"PORTFOLIO\" to see the actual results I've created for people just like you.\n\nP.S. I don't work with everyone. This is for serious professionals ready to invest in turning LinkedIn into their most profitable marketing channel.",
    "bannerImageUrl": [
      "https://ik.imagekit.io/amicoder/bushranasrullah/v1/banners/0.com_dms_image_v2_D4D16AQFLLZANPc4emg_profile-displaybackgroundimage-shrink_350_1400_B4DZjqp5SbGQAY-_0_1756283517526",
      "https://ik.imagekit.io/amicoder/bushranasrullah/v1/banners/1.com_dms_image_v2_D4D16AQGoD72GoLUHJA_profile-displaybackgroundimage-shrink_350_1400_B4DZjqp5WZH4Ac-_0_1756283511952"
    ],
    "profileImageUrl": "https://ik.imagekit.io/amicoder/bushranasrullah/v1/profile.com_dms_image_v2_D4D03AQGuUP7JIL0SQg_profile-displayphoto-shrink_800_800_B4DZO5f8mQGoAc-_0_1733983985238",
    "scrapedAt": "2025-12-02T03:28:26.031Z"
  }
}
