{
  "v1": {
    "username": "byrongrealy",
    "profileUrl": "https://www.linkedin.com/in/byrongrealy/",
    "fullName": "Byron Grealy",
    "headline": "Helping Founders Become Thought Leaders | Founder of Cue Studios",
    "about": "You’re already sitting on a goldmine (your personal brand). Let’s unlock it.\n\nI never set out to \"build a personal brand.\" I just started sharing what I knew.\n\nAnd then, something unexpected happened. Opportunities started coming my way. Clients. Speaking invites. Partnerships.\n\nThat was my first “aha” moment. This isn’t just posting online. It’s a growth engine.\n\nMost founders ignore their personal brand. Here’s why that’s a mistake.\n\nRight now, you’re running a business. You’re solving problems. You’re having conversations every day that could be turned into valuable content.\n\nBut instead:\n\n• You don’t know what to talk about\n• You’re not sure how you want to come across\n• You’re not leveraging your experience to attract the right people\n\nWhat if I told you you don’t have to do anything extra?\n\nYour daily insights are already content. You just need the right strategy to get it in front of the right people.\n\nThis is where I come in.\n\nI help founders turn their expertise into authority without wasting time or chasing vanity metrics.\n\nWhat I do:\n\n• Define your personal brand. Who you are, what you stand for, and how you should show up online\n• Create the right content for the right audience so you attract clients, investors, or opportunities\n• Develop a system so your brand runs without taking over your life\n\nAnd here’s what happens when we get it right:\n\n• Speaking engagements on top-tier stages\n• Inbound leads and investment opportunities\n• Industry recognition that makes you the go-to name in your field\n• A network of high-value relationships that drive your business forward\n\nI’ve helped tech founders, Web3 builders, and executives grow their influence and I can help you do the same.\n\nSo, what’s your next move?\n\nYou can keep letting others control the narrative about who you are.\n\nOr you can start shaping it yourself and attract the kind of opportunities that change everything.\n\nDM me or book a call. Let’s make your brand work for you.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4E16AQEiiTEo5f2LYw/profile-displaybackgroundimage-shrink_350_1400/B4EZVljsRDGgAY-/0/1741165611543?e=1760572800&v=beta&t=xXuv0_nQGHMN3Or33PAvj_AaGHMTXyIpKrXglXYAR5E",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4E03AQF6Yy1FtlZz-w/profile-displayphoto-shrink_800_800/B4EZWjhFliHMAc-/0/1742205115269?e=1760572800&v=beta&t=nZqUiUAIuWxkowuigKdrMCaE_SqiN0ODld8zj-fBDEA",
    "scrapedAt": "2025-09-10T08:09:23.278Z"
  }
}