{
  "v1": {
    "username": "daniel-korenblum",
    "profileUrl": "https://www.linkedin.com/in/daniel-korenblum/",
    "fullName": "Daniel Korenblum",
    "headline": "Growing your brand & business with LinkedIn content",
    "about": "I grew my LinkedIn audience from 0 to 20,000 in 6 months.\n\nThis is how it all came together ↓\n\nI spent years in social media and marketing, building brands for tech startups. \n\nI brought in tens of thousands of followers for them, but despite the success, I kept getting laid off. \n\n→ That’s when it hit me\n\nI was driving crazy results for others, but doing nothing for myself. \n\nSo, after my third layoff in early 2024, I decided it was time to bet on me and build my personal brand on LinkedIn. \n\nThe results?\n\n↳ A 6-figure online business\n↳ Top 10 LinkedIn Growth worldwide\n↳ Ranked #1 in Personal Branding in Germany\n\nNow, I help others achieve the same.\n\nP.S. Whenever you're ready, I can help you in 3 ways:\n\n1. Book my 1:1 LinkedIn Power Hour (and ask me anything).\n2. DM me for bespoke branding designed to attract your ideal audience.\n3. Apply to work with me for my done-for-you Personal Brand Takeover program.\n\nWhat LinkedIn's top 0.01% have to say about me:\n\n\"One thing about most designers on LinkedIn is that they don't get LinkedIn. Daniel does. He is growing at the speed of light here because he gets the whole thing (personal branding) and has design skillset to show it! If you're looking to level up your branding I'd talk to this guy!\"\n\nLara Acosta, Founder of LA Digital \n\n\"I love speed. When people are slow I refuse to give them a 2nd chance. I asked Daniel to make me a template for my webinar with only 6 hours to spare. He made it within the hour. That's a designer you want to use. Not only was he fast, his designs were clean.\"\n\nLuke Matthews, Founder of Wizard of Odd Marketing\n\n\"Daniel is a world-class designer. Designing content for social media isn't the same as designing for a brand. It requires a certain intelligence, a specific know-how to catch the culture of a platform. Daniel nailed the one from LinkedIn from the start. And I can't wait to see him blossoming even more here.\" \n\nRuben Hassid, Founder of EasyGen",
    "bannerImageUrl": "https://ik.imagekit.io/amicoder/daniel-korenblum/v1/banner.com_dms_image_v2_D4E16AQHOI73erxRTIA_profile-displaybackgroundimage-shrink_350_1400_profile-displaybackgroundimage-shrink_350_1400_0_1736020554877",
    "profileImageUrl": "https://ik.imagekit.io/amicoder/daniel-korenblum/v1/profile.com_dms_image_v2_D4E03AQGixny_kfLDmQ_profile-displayphoto-shrink_800_800_profile-displayphoto-shrink_800_800_0_1729181840386",
    "scrapedAt": "2025-12-02T03:30:12.261Z"
  }
}
