{
  "v1": {
    "username": "elizabeth-turner-dmd-b4848910",
    "profileUrl": "https://www.linkedin.com/in/elizabeth-turner-dmd-b4848910/",
    "fullName": "Elizabeth Turner DMD",
    "headline": "Airway & Sleep Dentist | Owner @ Balanced Dental Studio + Untethered Airway Health Center | Tethered Oral Ties | Laser Dentistry | Pediatric & Adult Care | DMD | Educator",
    "about": "With over a decade of experience in dentistry, I’ve come to believe this: we can’t separate oral health from whole body wellness and we shouldn’t try.\n\nI’m Dr. Elizabeth Turner, owner of Balanced Dental Studio and Untethered Airway Health Center. My passion lies in helping patients and providers uncover the root causes of breathing, sleep, and oral function challenges so they can experience real, lasting change.\n\nI hold a DMD from Tufts University School of Dental Medicine, an Advanced Education in General Dentistry from the University of New Mexico, and have completed extensive post-doctoral education in airway dentistry, sleep-disordered breathing, and tethered oral ties.\n\nMy work blends: \n\n✔️ Evidence-based dentistry\n✔️ Laser-focused treatment of tethered oral tissues\n✔️ Compassionate care for both pediatric and adult patients\n✔️ A whole-body approach to dental wellness\n\nWhether I’m working with a toddler struggling to sleep, a teen with restricted tongue function, or an adult navigating sleep apnea my approach is the same: personalized, informed, and rooted in long term health outcomes.\n\nI’m also passionate about helping other dentists bring airway and sleep treatment into their practices. That’s why we created Untethered Mail a free weekly email packed with our best tips, case studies, and practical tools to help providers grow with confidence.\n\nIf you want to bring better care to your patients or you're a parent or patient yourself looking for clarity without overwhelm subscribe at the link in my bio. We’ll make it simple, useful, and real.\n\nLet’s connect if you care about people-first dentistry and believe there’s always more to learn.",
    "bannerImageUrl": "https://ik.imagekit.io/amicoder/elizabeth-turner-dmd-b4848910/v1/banner.com_dms_image_v2_D5616AQEEEhiRRJZESw_profile-displaybackgroundimage-shrink_350_1400_B56ZcX8yjgGQAg-_0_1748453502210",
    "profileImageUrl": "https://ik.imagekit.io/amicoder/elizabeth-turner-dmd-b4848910/v1/profile.com_dms_image_v2_D5603AQG7aIPovHB-jQ_profile-displayphoto-shrink_800_800_B56ZcX8g0AHUAg-_0_1748453429052",
    "scrapedAt": "2025-12-02T03:31:26.205Z"
  }
}
