{
  "v1": {
    "username": "faraiha-tariq-79b7632a1",
    "profileUrl": "https://www.linkedin.com/in/faraiha-tariq-79b7632a1/",
    "fullName": "Faraiha Tariq",
    "headline": "Helping your LinkedIn brand to stand out | Co-Lead @DevQuest | UI UX designer | LinkedIn brand designer | Content designer | Graphic designer",
    "about": "I am an enthusiastic learner and aspiring professional passionate about exploring and excelling in diverse fields such as web development, UI/UX design, programming, and data structures. My journey began with creating a real-time weather-checking web application using HTML, CSS, and JavaScript. Since then, I have expanded my skill set by delving into advanced JavaScript features, frameworks, and design principles.  \n\nCurrently, I am honing my expertise in UI/UX design with projects like a neon-themed VR movie app and a vibrant food delivery app inspired by my favorite color, purple. These experiences have strengthened my ability to create intuitive and visually appealing designs using tools like Figma.  \n\nAlongside web technologies, I am also focused on mastering programming fundamentals and Data Structures & Algorithms (DSA). I enjoy solving problems involving arrays, linked lists, stacks, and recursion. Through these challenges, I’ve developed a keen interest in logical thinking and efficient coding practices.  \n\nI thrive in collaborative environments, as evident from my group project on book analysis and my active participation in events like CHAIAURCODE and STEM 3.0. My commitment to growth, coupled with a willingness to learn and adapt, drives me to excel in both academic and professional settings.  \n\nFeel free to connect with me for discussions on web development, design, or collaborative opportunities!",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4D16AQHbhuPX4tLfWg/profile-displaybackgroundimage-shrink_350_1400/B4DZf5LKWZHABE-/0/1752232146284?e=1759363200&v=beta&t=vu1us5L3mImrzf3GNr9IJy9U4NT_60L40z2CH8wi6-g",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4D03AQHNKX_C0DeE_g/profile-displayphoto-crop_800_800/B4DZf5K7czGsAI-/0/1752232084910?e=1759363200&v=beta&t=3RucyaeEL2eW0voXbcREre3iJCX1uj87GQjidwqdjtc",
    "scrapedAt": "2025-08-26T10:14:26.315Z"
  }
}