{
  "v2": {
    "username": "fatouseckmathon",
    "profileUrl": "https://www.linkedin.com/in/fatouseckmathon/",
    "fullName": "Fatou Seck Mathon",
    "headline": "Executive Coach, helping senior leaders on their journey to VP+ level. Leadership Consultant for High Performing Organizations. Trusted by Fortune 500 leaders. Supporting clients globally in both English and French.",
    "about": "I believe every talent should be celebrated.\n\nToo often, ambitious leaders work hard, earn the title, yet still feel invisible, overextended, or disconnected from what truly matters. \n\nAnd many organizations sometimes push for results but overlook the human side of leadership, leaving potential untapped.\n\nThis is where I come in.\n\nI’m Fatou, Executive & Leadership Coach and Consultant, with 20+ years of experience across industries. I’m certified by Columbia University, with advanced leadership credentials from Yale Business School and IMD Switzerland. I founded Sargal Coaching (Sargal means “celebrate” in my home country, Senegal) to support leaders and organizations in building recognition, influence, and sustainable success.\n\n🚀 For senior executives & leaders:\n\nI run The Executive Edge, a high-touch coaching program designed to help you:\n\t•\tGain clarity on your career vision and roadmap.\n\t•\tStrengthen your executive presence and influence.\n\t•\tIncrease your visibility and recognition at the highest levels.\n\t•\tCreate balance so success is sustainable, not exhausting.\n\nThis is not about working harder, it’s about being seen, valued, and celebrated for your true impact.\n\n🏢 For organizations:\n\nAs a Leadership Consultant, I help companies improve performance through human-centered leadership.\nThat means designing leadership cultures where:\n\t•\tManagers lead with empathy and influence, not just authority.\n\t•\tTeams are engaged, resilient, and aligned with strategic goals.\n\t•\tPerformance improves because people feel valued, recognized, and empowered.\n\nThrough consulting projects, workshops, and executive development initiatives, I work with organizations who understand that business results and human-centered leadership go hand in hand.\n\n🌟 My philosophy:\n\nLeadership is not just about hitting targets, it’s about creating environments where people thrive and performance follows naturally.\n\nIf you’re a senior leader ready to step into recognition and balance, or a corporate leader looking to transform leadership culture, let’s connect.\n\n📩 DM me here on LinkedIn or directly book a call. \n\nhttps://calendly.com/fseckmathon/clarity-call?",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4E16AQE8lsuoNVw7lQ/profile-displaybackgroundimage-shrink_350_1400/B4EZlMuoeaKcAY-/0/1757928917571?e=1761177600&v=beta&t=9bY3zMsIXxWe33YcOhsaKYe9qMh9F1Udhadw9zUyz-o",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4E03AQG-30WixWBMsA/profile-displayphoto-crop_800_800/B4EZeolxxfHcAM-/0/1750880165609?e=1761177600&v=beta&t=0d5FRznzZ_n9PPRrR_aqViqXt7TxnxEY6bUQc8l7x2Q",
    "scrapedAt": "2025-09-18T00:12:42.070Z"
  },
  "v1": {
    "about": "As an Executive and Leadership Coach, I am passionate about empowering leaders to unlock their full potential and create impactful, lasting change within their organizations. With a focus on emotional intelligence, I guide leaders to enhance their influence and cultivate a thriving team environment.\n\nOver the years, I've partnered with executives across diverse industries, equipping them with the skills and insights necessary to drive meaningful transformation and achieve their professional goals. My tailored coaching approach combines proven strategies with a deep understanding of human behavior, enabling leaders to navigate complex challenges with confidence and clarity.\n\nI firmly believe that effective leadership stems from the ability to connect on a personal level while inspiring others to excel. Whether you're looking to enhance your leadership skills, improve team dynamics, or drive organizational growth, I'm here to support your journey to success.\n\nSargal means celebrate in Senegalese, my country of origin. I believe we all have talents to celebrate.\n\nConnect with me to discover how you can elevate your leadership impact and create a legacy of positive influence.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4E16AQEKVjJf-TGMtA/profile-displaybackgroundimage-shrink_350_1400/B4EZen69EfHIAc-/0/1750868939590?e=1758758400&v=beta&t=9eRVd8vdgSC-JP-qx-vo48Tkx1sZpZu_V5AkOpkCzM4",
    "fullName": "Fatou Seck Mathon",
    "headline": "Helping female leaders on their journey to VP+ level. Lead boldly without compromising who you are. Executive Coach and Leadership Consultant. Trusted by Fortune 500 leaders. Supporting clients globally 🌎.",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4E03AQG-30WixWBMsA/profile-displayphoto-crop_800_800/B4EZeolxxfHcAM-/0/1750880165609?e=1758758400&v=beta&t=rrEpwQdvh9moyFnMhIKclVXRIEF5D7CJF5_hQTe8Z-w",
    "profileUrl": "https://www.linkedin.com/in/fatouseckmathon/",
    "scrapedAt": "2025-08-26T00:04:04.058Z",
    "username": "fatouseckmathon"
  }
}