{
  "v1": {
    "username": "fatouseckmathon",
    "profileUrl": "https://www.linkedin.com/in/fatouseckmathon/",
    "fullName": "Fatou Seck Mathon",
    "headline": "Helping female leaders on their journey to VP+ level. Lead boldly without compromising who you are. Executive Coach and Leadership Consultant. Trusted by Fortune 500 leaders. Supporting clients globally 🌎.",
    "about": "As an Executive and Leadership Coach, I am passionate about empowering leaders to unlock their full potential and create impactful, lasting change within their organizations. With a focus on emotional intelligence, I guide leaders to enhance their influence and cultivate a thriving team environment.\n\nOver the years, I've partnered with executives across diverse industries, equipping them with the skills and insights necessary to drive meaningful transformation and achieve their professional goals. My tailored coaching approach combines proven strategies with a deep understanding of human behavior, enabling leaders to navigate complex challenges with confidence and clarity.\n\nI firmly believe that effective leadership stems from the ability to connect on a personal level while inspiring others to excel. Whether you're looking to enhance your leadership skills, improve team dynamics, or drive organizational growth, I'm here to support your journey to success.\n\nSargal means celebrate in Senegalese, my country of origin. I believe we all have talents to celebrate.\n\nConnect with me to discover how you can elevate your leadership impact and create a legacy of positive influence.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4E16AQEKVjJf-TGMtA/profile-displaybackgroundimage-shrink_350_1400/B4EZen69EfHIAc-/0/1750868939590?e=1758758400&v=beta&t=9eRVd8vdgSC-JP-qx-vo48Tkx1sZpZu_V5AkOpkCzM4",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4E03AQG-30WixWBMsA/profile-displayphoto-crop_800_800/B4EZeolxxfHcAM-/0/1750880165609?e=1758758400&v=beta&t=rrEpwQdvh9moyFnMhIKclVXRIEF5D7CJF5_hQTe8Z-w",
    "scrapedAt": "2025-08-26T00:04:04.058Z"
  }
}