{
  "v1": {
    "username": "fatouseckmathon",
    "profileUrl": "https://www.linkedin.com/in/fatouseckmathon/",
    "fullName": "Fatou Seck Mathon",
    "headline": "Certified Executive Coach. I help women leaders step into bigger roles and opportunities by increasing their visibility and communicating their value. Leadership Consultant.",
    "about": "You’ve spent years delivering results, working hard, and being the person people rely on.\nYet you’re still not getting the visibility, recognition, or opportunities you deserve.\n\nI’ve been there too.\n\nDuring my 20 years in corporate roles, I watched talented women leaders stay under-recognized while others with more visibility, not necessarily more competence,  moved ahead.\n\nAnd I learned something important:\n\nCareer growth doesn’t come from effort alone.\nIt comes from being seen, valued, and strategically positioned.\n\nToday, as a Certified Executive Coach from Columbia with additional leadership certifications from Yale School of Management and IMD Switzerland, I help  leaders accelerate their career growth by strengthening the skills that actually create upward movement:\n\n✨ Visibility that attracts bigger opportunities\n✨ Communication that earns trust and influence\n✨ Self-leadership that builds clarity, confidence, and authority\n✨ Presence that positions you for senior-level roles\n\nMy clients come to me when they’re ready for more, but feel like they’ve hit a plateau they can’t explain.\n\nTogether, we uncover the patterns slowing their progress and build the leadership identity required for their next chapter. The results are powerful:\n\n✔ Stepping into senior roles \n✔ Being selected for high-visibility projects\n✔ Leading with confidence, calm, and clarity\n✔ Being recognized for their impact not just their effort\n✔ Attracting new internal or external career opportunities\n\nBecause when you know how to communicate your value, show your impact, and lead yourself with intention, Your career moves very differently.\n\n⸻\n\nIf you’re ready for your next level:\n\n📩 Send me a DM with “NEXT LEVEL” and we will work on defining and reaching your next level. \n\nor\n\n🔗 Take the Career Growth Assessment in my Featured Section to uncover your blind spots and strengths.\n\nYour next chapter isn’t created by chance.\n\nIt’s created by how you choose to lead yourself, starting now.",
    "bannerImageUrl": "https://ik.imagekit.io/amicoder/fatouseckmathon/v1/banner.com_dms_image_v2_D4E16AQH6vkrwbWe6QQ_profile-displaybackgroundimage-shrink_350_1400_B4EZrWUwMFGUAY-_0_1764532356744",
    "profileImageUrl": "https://ik.imagekit.io/amicoder/fatouseckmathon/v1/profile.com_dms_image_v2_D4E03AQG-30WixWBMsA_profile-displayphoto-crop_800_800_B4EZeolxxfHcAM-_0_1750880165609",
    "scrapedAt": "2025-12-02T03:32:33.360Z"
  }
}
