{
  "v1": {
    "username": "ghostwriter-umme-habiba",
    "profileUrl": "https://www.linkedin.com/in/ghostwriter-umme-habiba/",
    "fullName": "Umme Habiba",
    "headline": "Ghostwritten for forbes 30u30 & YC founders | 50+ clients,150k+ followers & 100M+ views later, now building the #1 personal branding agency @social narrativ | Co-founder @saas landings- startup landing pages design",
    "about": "You're looking at one of the top 10% ghostwriters on LinkedIn. I've clocked in 100s of posts, dabbled across 10+ industries, and mastered the art of persuasive storytelling.\n\nMy posts don't just look pretty; they drive action. We're talking about a whopping 1,000,000+ impressions, 2239+ likes and countless leads generated from a SINGLE post I wrote for a client.\n\nBut don't take my word for it:\n\nHere's what a 7x founder has to say about me:\n\n“Since working with Umme on ghostwriting my social media posts, I’ve seen a real difference in my engagement. The content she creates perfectly captures my voice and resonates with my audience. I’m constantly getting compliments and questions about my insightful posts.\"\n\nYou won't get generic posts that don't give any value to the reader. I write on-brand content that aligns with your unique voice and tone. Again, don't just take my word for it👇\n\n\"She captured my leadership style perfectly, crafting insightful LinkedIn content that positioned me as an authority in the recruitment space. I’ve seen a significant increase in qualified candidates reaching out and valuable industry connections.\"\n~CEO, Recruitment company\n\nMY SERVICES:\n\n• Complete LinkedIn Profile Optimization\n• Custom Content strategy\n• Content Creation and Scheduling\n• Personal brand Management\n• Performance reports and analytics\n\nWhat really sets me apart, though? My commitment.\n\nClients have sung praises like, “Umme Habiba truly understands her craft. It’s not just about turning people into brands; she excels in doing it in a human and organic way. That’s where she really shines. If you’re looking for someone who pays meticulous attention to detail, she is the one.”\n\nAccessibility and reliability? Check and check. I'm the girl who's always there, always eager, and never misses a beat (or a deadline). With me, you get content that doesn't just exist – it performs, convinces, and converts.\n\n\"I had a little over 100 followers when I decided to work with Umme Habiba to help with my content strategy.\nI knew what I wanted to share but I needed to learn how best to get my message across.\nThanks to her I’m nearing 3000 followers which is helping gain visibility towards my newsletter.\nDefinitely reach out to her if you need help with growing your Personal brand.\"\n\n~$100M investment fund manager\n\nIf you need LinkedIn posts, Tweets, Newsletter copy or email copywriting that resonates with your ICP, let's chat.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4D16AQHCozS1cSy4Yw/profile-displaybackgroundimage-shrink_350_1400/B4DZY9UvjMHIAY-/0/1744785572701?e=1761177600&v=beta&t=cRlqkY1_Byampm7hV5LqQv49rHTBbtt2K9_jB96QZQQ",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4D03AQG5F4odYogqZA/profile-displayphoto-crop_800_800/B4DZi0d.nVH4AU-/0/1755374415305?e=1761177600&v=beta&t=e05AHxIxDaMIy3QNVMifvJVjlW9ddruoR-VY86DiV6Q",
    "scrapedAt": "2025-09-18T00:18:28.004Z"
  }
}