{
  "v1": {
    "username": "javeriarao",
    "profileUrl": "https://www.linkedin.com/in/javeriarao/",
    "fullName": "Javeria Rao",
    "headline": "Freelance Social Media Manager & PersonaI Branding Strategist | I manage your socials so you can focus on what really matters | 50+ clients worldwide.",
    "about": "Hi, I am Javeria\n\nI help brands like yours turn social media into a powerhouse for growth—cutting through the noise with strategic content, meaningful engagement, and a brand presence that demands attention.\n\nAs a Social Media Manager and Personal Brand Expert I’ve helped brands like yours turn their social media into a valuable asset that drives growth. Through tailored strategies and engaging content, I ensure your message resonates with the right people, on the right platforms.\n\nHere’s what I can do for you:\n\n- Social Media Management (FB, Instagram, LinkedIn, TikTok, Pinterest, YouTube)\n- Social Media Strategy Development – because posting without a plan is like shouting into the wind\n- Content Creation & Copywriting – words that sell, visuals that captivate\n- Personal Brand Development (LinkedIn or IG) – positioning you as an expert\n- Social Media Consulting – guiding you every step of the way\n\nThe best part? \n\nWhile I handle the social media grind, you get to focus on what matters most—your business.\n\nLet’s build real connections with your audience and bring your vision to life. Ready to elevate your brand?\n\nFeel free to reach out at:\nworkwithjaveriaa@gmail.com\n\nLet’s create a lasting impact!",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4D16AQFqvnFNDUmVXw/profile-displaybackgroundimage-shrink_350_1400/B4DZbskRxBG0Ac-/0/1747725656306?e=1759363200&v=beta&t=TjvALGgw32PO65DoWLCqiHDMfvVHSbp1A9pcrrPJtxc",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4D03AQHaFQjLuu_9MQ/profile-displayphoto-shrink_400_400/B4DZbskNy7G0Ag-/0/1747725639417?e=1759363200&v=beta&t=jVB3NjuH3wWBGjpVYo9sO_DpJIsGk3Kg3yWgFD2-keI",
    "isProvider": true,
    "scrapedAt": "2025-08-28T08:29:57.266Z"
  }
}