{
  "v1": {
    "username": "jimzarkadas",
    "profileUrl": "https://www.linkedin.com/in/jimzarkadas/",
    "fullName": "Jim Zarkadas",
    "headline": "Helping SaaS teams grow from $1M to $10M ARR by turning Frankenstein UX into delightful experiences that convert",
    "about": "I help product-led SaaS teams grow from $1M to $10M ARR by turning Frankenstein UX into delightful product experiences that convert.\n\nIf you are under $1M ARR, you probably do not have a designer. Your dev team has been shipping features for years, but without a design system or UX oversight the product has started to feel inconsistent and confusing.\n\nThe result?\nA Frankenstein UX that slows growth, frustrates users, and makes onboarding harder than it should be.\n\nI know this struggle because I used to be a developer. I saw first-hand how design bottlenecks, low adoption, and poor onboarding hold back great products.\n\nThat is why I started Love at First Try, a in-house-design-team-as-a-service in the top 5 for bootstrapped SaaS teams.\n\n✓ Only 2 clients per designer → deep focus on your SaaS\n✓ Fully integrate into your team → no silos\n✓ Design for growth → but also for delight (so your users become true fans)\n✓ Weekly design handoffs → your dev team always has something ready to ship\n\nMost SaaS teams reach out because:\n→ Their UX has become a tangled mess after years of feature-first shipping\n→ Onboarding is not converting trial users into paying customers\n→ Feature adoption is too low to hit growth targets\n→ They do not have an in-house design team to fix it\n\nWe solve all of that. Our work has helped teams like Zenmaid and KnowledgeOwl improve their UX, boost feature adoption, ship faster, and grow past $1M ARR.\n\nIf you are building a great product but design is slowing you down, I would love to help.\n\n📩 DM me here on LinkedIn or visit loveatfirsttry.io",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4E16AQHj4xMGZwhBFQ/profile-displaybackgroundimage-shrink_350_1400/B4EZileqJCGwAY-/0/1755122943481?e=1761177600&v=beta&t=S0SEMlwRjU9lKK9suWcpzjgNH7schK5qbwB2OiZPjPw",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4E03AQEn51Y86AWuhg/profile-displayphoto-crop_800_800/B4EZilfyckHoAI-/0/1755123236153?e=1761177600&v=beta&t=BoIY0yzn6BX44-igneG6jVjJ-iJjW9SBXb83eWGDJfs",
    "scrapedAt": "2025-09-19T13:57:41.009Z"
  }
}