{
  "v1": {
    "username": "jouimariam",
    "profileUrl": "https://www.linkedin.com/in/jouimariam/",
    "fullName": "Mariam Joui",
    "headline": "I build email systems that turn your visibility into premium clients | for women coaches, consultants, solopreneur who want predictable sales without chasing leads.",
    "about": "Helping Women Coaches, consultants turn visibility into clients\n\nYou’re amazing at what you do, but ... your inbox isn’t bringing in clients (yet).\nYou’ve tried posting, referrals, and a content calendar, but it’s exhausting to stay consistent with little return.\n\nSound familiar?\n\n➜ You know your email list SHOULD be making you money, but it’s just sitting there.\n➜ You’re tired of chasing leads or relying on the algorithm for visibility.\n➜ You want a steady flow of premium clients ... without having to be “ON” all the time.\n\nThat’s where I come in, my dear!\n\nI build done-for-you email systems that turn your subscribers into premium clients .... so you can finally step off the content treadmill and focus on your genius.\n\nFrom strategy to setup, I handle:\n1. Lead magnet creation that attracts your dream clients\n2. Automated email sequences that nurture and sell\n3. Tech setup, integrations, and optimization ... all done for you\n\nI specialize in building systems that quietly work in the background and bring in cash & clients while you run your business.\n\nIf you’re ready to turn your email list into a client-generating machine.\n\n→ Reach out to me and let’s build your system.\n→ Or book a call through my Featured section",
    "bannerImageUrl": "https://ik.imagekit.io/amicoder/jouimariam/v1/banner.com_dms_image_v2_D4E16AQEvW_fCsog2WQ_profile-displaybackgroundimage-shrink_350_1400_B4EZk_KWuvHgAY-_0_1757701379173",
    "profileImageUrl": "https://ik.imagekit.io/amicoder/jouimariam/v1/profile.com_dms_image_v2_D4E03AQGOXF7rFKlMYA_profile-displayphoto-crop_800_800_B4EZrKz7JBIoAI-_0_1764339235226",
    "scrapedAt": "2025-12-02T04:08:57.786Z"
  }
}
