{
  "v1": {
    "username": "klaudia-szwajkosz",
    "profileUrl": "https://www.linkedin.com/in/klaudia-szwajkosz/",
    "fullName": "Klaudia Szwajkosz",
    "headline": "Done-For-You LinkedIn for CEO's, Coaches & Creators: I help you stop sounding like everyone else and start building magnetic authority™ through soul-aligned messaging.",
    "about": "You didn’t start your business to become a full-time content creator or run back-to-back sales calls with people who’ll never buy.\n\nYou started it to create real impact. To lead. To live with more freedom, not less.\n\nBut somewhere along the way, the game changed.\n\nYou’re showing up online, but not seeing the results.\n\nYour voice blends in.\n\nYour brand doesn’t reflect the authority you bring to the table.\n\nMeanwhile, others seem to magnetize opportunities:\n\n- the podcast invites, \n- the paid collaborations, \n- the pre-sold clients... \n\nwhile you’re still stuck explaining what you do.\n\nPicture how your business and life would change once you become the voice of your industry.\n\nThat’s what I help you do.\n\nI’m Klaudia, creator of the Magnetic Authority System™.\n\nHaving successfully grown my brand to over 40,000 followers in 12 months and designed a business that enables me to work from anywhere, often just a few hours a day, while consistently attracting premium clients.\n\nMy mission now is to help others build this same level of leverage in their businesses.\n\nI work with coaches, founders, and creators who are ready to step into their category of one.\n\nBut I don’t rely on hacks, fake urgency, or gimmicky tactics.\n\nWe clarify your positioning. \nBuild your LinkedIn authority engine. \nAnd install a brand ecosystem that attracts aligned opportunities on autopilot (so you can be at the beach on a random Tuesday, or work on growing your business, not just maintaining it).\n\nMy clients go from overlooked to in-demand.\n\nFrom explaining their value to commanding attention and premium rates.\n\nBecause we don’t just do content. We build Magnetic Authority.\n\nThe kind that makes people say: “I’ve been following you for a while, how can we work together?”\n\nSo if you’re:\n\n→ An expert with a proven offer\n→ Tired of the hustle-heavy tactics\n→ Craving more recognition, aligned opportunities, and freedom of time...\n\nYou're in the right place.\n\nThere are 3 ways to work with me:\n\n1) Magnetic 1:1 Mentorship – For founders and creators who want expert feedback, clarity, and momentum with their content and brand.\n\n2) Done-for-You Authority Engine – For busy business owners who want to show up powerfully online without writing a single post.\n\n3) The Magnetic Authority System™ – The full-stack, done-for-you brand positioning and content ecosystem designed to create leverage. \n\nIf you’re ready to lead, not chase, \nDM with the word “MAGNETIC” and I’ll send you the details.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4E16AQFeC_kepJ59mA/profile-displaybackgroundimage-shrink_350_1400/B4EZhWh7q5HgAY-/0/1753798393376?e=1758758400&v=beta&t=U4zWw1OB_BpdDsJEei4vDfCDTOdw3iFRi9BXbNBs3Nk",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D5603AQEpyyxhyyupgg/profile-displayphoto-shrink_800_800/B56ZZ44tKBHAAc-/0/1745784853941?e=1758758400&v=beta&t=yZWvgWNAWtBXsa1rHUX13sGNe9R0HQu3pTApTwn6eww",
    "scrapedAt": "2025-08-25T23:49:14.316Z"
  }
}