{
  "v1": {
    "username": "lauren-murrell",
    "profileUrl": "https://www.linkedin.com/in/lauren-murrell/",
    "fullName": "Lauren Murrell",
    "headline": "Founder | Follow for posts on Resilience, Mindset & Personal Growth | Ex-Lawyer | Oxford Grad | #1 Female Creator in Startups & Entrepreneurship",
    "about": "Looking to build your resilience, mindset and personal growth? You’re in the right place.\n\nI share practical tools, stories and insights that help people grow through challenges and show up with confidence.\n\nMy work draws on lived experience: surviving leukaemia with a 20% survival chance, rebuilding my life, starting my international legal career, and co-founding an award-winning wellness brand with my sister.\n\nHere’s how I can support you:\n\n→ Speaking at events and panels on navigating hard chapters and growing through them\n→ Weekly newsletter, Rise on Purpose, packed with actionable tips for life and work\n→ Daily content on resilience, mindset and growing through life’s challenges\n\nThe story so far:\n\n2012: Diagnosed with acute myeloid leukaemia; my sister became my stem-cell donor and saved my life\n2013: Hospitalised in protective isolation for months, and helped raise £60K+ for leukaemia research\n2014: Hair grew back and strength slowly returned, I made it back to law school and began my legal career\n2016: Manifested a dream from hospital when I moved to New York to work in corporate law\n2017: Relocated to the British Virgin Islands and lived through Hurricane Irma\n2018: Returned to the UK and co-founded skincare By Sarah with my sister\n2019: Featured in Vogue, Forbes, The Times and Marie Claire for the first time\n2020: During Covid, started sharing the mindset tools that helped me through isolation in hospital\n2022: Completed Goldman Sachs 10KSB in partnership with Oxford University\n2024: Secured retail listings with Ocado, Planet Organic and Healf\n2025: Grew my audience to 70K+ and ranked #1 Female Creator globally in Startups & Entrepreneurship\nNow: Sharing what I’ve learned through talks, panels and brand partnerships\n\nIf you’re looking for a thoughtful perspective on resilience and personal growth, feel free to reach out.\n\nDM me or visit lauren-murrell.com for more.",
    "bannerImageUrl": "https://ik.imagekit.io/amicoder/lauren-murrell/v1/banner.com_dms_image_v2_D4D16AQEhjES3OTya8g_profile-displaybackgroundimage-shrink_350_1400_B4DZfUKre0GgAY-_0_1751611259655",
    "profileImageUrl": "https://ik.imagekit.io/amicoder/lauren-murrell/v1/profile.com_dms_image_v2_D4D03AQETxutc-c8SKg_profile-displayphoto-shrink_800_800_profile-displayphoto-shrink_800_800_0_1721993487775",
    "scrapedAt": "2025-12-02T04:20:30.179Z"
  }
}
