{
  "v1": {
    "username": "lauren-murrell",
    "profileUrl": "https://www.linkedin.com/in/lauren-murrell/",
    "fullName": "Lauren Murrell",
    "headline": "Co-Founder at skincare By Sarah | Leukaemia Survivor | Ex-International Lawyer | Daily Posts on Personal Growth & Mindset",
    "about": "Lauren Murrell is an entrepreneur, former lawyer and leukaemia survivor, captivating people with her inspiring daily posts on personal growth and resilience in life and business.\n\nShe is the co-founder of skincare By Sarah. When Lauren was diagnosed with acute myeloid leukaemia (with only a 20% survival rate), her sister, Sarah, became her stem cell donor and saved Lauren's life. As Lauren recovered, Sarah struggled to find natural yet effective products to soothe and revitalise Lauren's cancer ravaged skin. So she decided to develop her own formulas and, with this act of sisterly love, skincare By Sarah was born. \n\nBy Sarah is stocked with Ocado, Healf and Planet Organic, endorsed by the UK's leading health and wellness professionals, including Liz Earle MBE and Caroline Hirons, and rated Excellent by their loyalty community of superfans. With an incredible founding story and transformative results, it's the brand everyone's talking about. \n\nLauren is a qualified lawyer having specialised in corporate law and worked in London, New York and the British Virgin Islands (facing the wrath of Hurricane Irma). Prior to which Lauren graduated from Oxford University with an M.A. in Geography (First Class Honours) and a LLB from the University of Law. She is also an alumna of the Goldman Sachs 10KSB programme. Lauren's charitable roles included Vice Chair of Trustees of The Little Princess Trust and raising over £60,000 to sponsor a PhD student at the UCL Cancer Institute in London.\n\nLauren has been quoted in The Times, British Vogue and Forbes, as well as featured on leading podcasts including Deliciously Ella and The Power Hour, and is a popular speaker inspiring audiences with her hard won lessons of courage and resilience - which will one day be featured in a best-selling book.\n\n⇾ For speaking enquiries, visit lauren-murrell.com\n⇾ For more about By Sarah, visit bysarahlondon.com",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4D16AQEhjES3OTya8g/profile-displaybackgroundimage-shrink_350_1400/B4DZfUKre0GgAY-/0/1751611259655?e=1759363200&v=beta&t=BSMpXx9cgFFPPFls6WYMFKwEHHFKiKc513x_CmfQGpk",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4D03AQETxutc-c8SKg/profile-displayphoto-shrink_800_800/profile-displayphoto-shrink_800_800/0/1721993487775?e=1759363200&v=beta&t=eFn3W3N0p6EWjl5XQcTqUjAYLaY2Tzlukbciy4VMOOg",
    "scrapedAt": "2025-08-26T08:30:25.487Z"
  }
}