{
  "v1": {
    "username": "mariam-gogidze",
    "profileUrl": "https://www.linkedin.com/in/mariam-gogidze/",
    "fullName": "Mariam (Mariko) Gogidze",
    "headline": "Building authority-driven personal brands that drive deal flow and attract new business opportunities | Personal Brand Strategist | Coaching | Founder @LinkedInAcademy, @Ascend Capital Branding (ACB) 👩🏼‍💻",
    "about": "A personal brand isn’t just about presence - it’s about the value and impact.\n\nThe kind of impact that positions you as an authority, turns visibility into trust, and opens doors to opportunities you didn’t even know were there.\n\nI’ve built my career helping professionals like you achieve exactly that.\n\nRecognised by Entrepreneur Magazine, trusted by professionals from HSBC, Ford, Amazon, and Danone, and followed by over 60,000 people worldwide, I specialise in transforming how you’re seen - and what that visibility can unlock.\n\nBut let me take you back for a moment.\n\nAt 16, I was a London teenager with big ambitions and no connections. Fast forward, and I’ve coached over 120 professionals, created strategies that thrive globally, and earned a reputation as a Top LinkedIn Marketer.\n\nWhat’s the secret?\n\nIt starts with understanding that your reputation is your greatest asset.\n\n↳ LinkedIn is home to 65 million decision-makers, ready to act.\n↳ Leaders with strong personal brands attract 4x more opportunities.\n↳ Consistency in branding increases visibility by 33%, keeping you top of mind.\n\nWhy does this matter for you?\n\nBecause the world is always watching.\nYour profile is being searched by those who matter.\nYour expertise is quietly evaluated against others in your field.\nAnd the right people are deciding whether to reach out - or move on.\n\nThis is where I come in.\n\nI help you:\n\n1. Position your expertise to stand out in your industry.\n2. Attract premium clients, partnerships, and opportunities.\n3. Build trust and authority in a way that feels natural and authentic.\n\nImagine this:\n\n→ Your LinkedIn becomes a magnet for the right connections.\n→ Your profile reflects not just what you do, but the impact you deliver.\n→ Your personal brand works for you, building trust and opening doors, 24/7.\n\nWhether you’re in London, New York, or Dubai, the right opportunity is closer than you think.\n\n\n💌 For brand partnerships, reach me at mariam@linkedinacademy.com",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4D16AQGo06A3NwJNGg/profile-displaybackgroundimage-shrink_350_1400/profile-displaybackgroundimage-shrink_350_1400/0/1737979335799?e=1759363200&v=beta&t=XOwDFYGqL3eqxF2X6nNEzjUEaurrhbls5jZ5Lcz69Vg",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4D03AQHLf82C8knqVA/profile-displayphoto-shrink_800_800/B4DZQdysI5HYAc-/0/1735666615815?e=1759363200&v=beta&t=Qq0i6rXTssGw6XnAULxAPWrT6DxCUjXzbguzEiWRtqQ",
    "scrapedAt": "2025-08-26T08:08:21.576Z"
  }
}