{
  "v1": {
    "username": "marialeden",
    "profileUrl": "https://www.linkedin.com/in/marialeden/",
    "fullName": "Maria Ledentsova",
    "headline": "Resources + educational content for B2B marketers & solopreneurs | Notion Ambassador | Personal Branding Consultant | GrowthMentor",
    "about": "Hey, I'm Mariaaaa — a solopreneur, marketing consultant, content creator & Notion Ambassador based in Berlin.\n\nI create content, templates / resources, and build communities for marketers and founders — with a focus on content marketing, personal branding, and systems that make work easier (and more fun).\n\nAfter being a first / founding marketing at a design startup for almost 2 years, it's time to scratch that itch and go all in on building my own thing.\n\nI write about what I’m learning in this transition from 9-5 to solopreneurship, work with a select few freelance clients, mentor on personal branding and partner with tools I use & believe in.\n\nIf you're a marketer or solopreneur figuring it all out step by step — you're in the right place 💜\n\nLet’s connect. We can collab, work together, co-host an event, or I can make engaging content for you — just reach out and we'll explore the best next step <3\n\n🧠 Languages I speak: Russian, German, English (and I'm finally picking up my Italian again!!)\n✨ What I care about: growth, curiosity, community, and being your biggest cheerleader\n\nBasically every day you’ll also find me at a calisthenics class, grabbing vegan lunch with friends, or co-working at one of my favorite Berlin cafés.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4E16AQG2ggM1tuR_FA/profile-displaybackgroundimage-shrink_350_1400/B4EZkY2lr8IoAY-/0/1757058588633?e=1761177600&v=beta&t=ilusuhMy0g0G9WJzGkqzTPr3cmCsUSXqd89we60Qyng",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D5603AQHhw7T9wJHfzg/profile-displayphoto-crop_800_800/B56ZhfaWUqHcAU-/0/1753947402475?e=1761177600&v=beta&t=Q-56DiRny4gH-Qt5xXuumcurmaT0JKpCeHlUC-zemjM",
    "scrapedAt": "2025-09-20T11:35:55.417Z"
  }
}