{
  "v1": {
    "username": "mbilalalam",
    "profileUrl": "https://www.linkedin.com/in/mbilalalam/",
    "fullName": "Bilal Alam",
    "headline": "LinkedIn Profile & Content Designer for Founders + Coaches → Stand Out. Build Authority. Save Time.",
    "about": "You're a founder or a coach, and you know visuals matter\n\nStill, you're trying to DIY them, thinking you're saving money\n\nBut here's what it's really \"costing\" you:\n\n1. Your profile looks like every other profile\n\n↳ Do you want your product to look like every other?\nNo. Right? Then why should your profile? It needs to stand out\n\n2. Your content doesn’t grab attention\n\n↳ You have \"gold-level\" insights in your posts, yet they get ignored because your visuals don’t stop the scroll\n\nGreat design makes sure your content gets noticed by stopping the scroll in the endless LinkedIn feed\n\n3. The most important: You are wasting time\n\n↳ The time you spend tweaking visuals is time you could use to focus on what you’re actually great at\n\nOutsourcing your visuals frees up that time, so you can grow your business instead of wrestling with Canva\n\nNow you know the importance of outsourcing your designs, so let's help you outsource them\n\nHi, I’m Bilal! Your design partner for LinkedIn profile and content visuals\n\n I’ve helped multiple founders and coaches revamp their profiles and design their content\n\nTo help them stand out, build trust and position themselves as the go-to experts of their niche\n\nI could sit here and tell you how \"good\" my designs are\nBut why take my word for it? So I’ll let my clients' words do the talking 👇\n\n→ \"If you want your content to work, Bilal is the man to see\" - Alexander Plank, Mindset Coach\n\n→ \"Bilal rebranded my profile and the quality of his design is next level\" - Manu Peral, RegTech Ghostwriter\n\n→ \"If you're looking for someone who is skilled and delivers top-notch results, Bilal is the one to go to!\" - Michele Klein, PMP-Certified Project Manager\n\n→ \"Now my profile finally looks professional and highlights what I offer with confidence\" - Rachel Castor, Social Media Coach\n\n→ \"I can’t recommend working with him highly enough\" - Abril Lespade, Social Media Marketer\n\nAnd more...\n\nThat’s what my clients say\n\nNow let’s talk about what I can do for you\n\nHere's how I can help you:\n\n• Profile Revamp → Complete revamp of your profile to make your profile stand out and convey your message effectively\n  \n• Monthly Content Support → Ongoing design support to make your every post scroll-stopping and authority-building.\n  \n• Visual Branding → Full branding package so your business looks consistent and professional everywhere\n\nMy goal is simple: \"make your brand look as good as it really is\"\n\nReady to work together or have any questions? \n\nMy DMs are open for convos. Feel free to reach out\n\nThanks for reading till the end. You are amazing!",
    "bannerImageUrl": "https://ik.imagekit.io/amicoder/mbilalalam/v1/banner.com_dms_image_v2_D4D16AQESxLX4cVsQ-A_profile-displaybackgroundimage-shrink_350_1400_B4DZo6gCETIEAY-_0_1761918076819",
    "profileImageUrl": "https://ik.imagekit.io/amicoder/mbilalalam/v1/profile.com_dms_image_v2_D4D03AQEyZ8C_fL-o-A_profile-displayphoto-crop_800_800_B4DZjcZf2oGkAM-_0_1756044332361",
    "scrapedAt": "2025-12-02T03:12:01.280Z"
  }
}
