{
  "v1": {
    "username": "meeraremani-executivecoach",
    "profileUrl": "https://www.linkedin.com/in/meeraremani-executivecoach/",
    "fullName": "Meera Remani",
    "headline": "Executive Coach helping VP-CXO leaders and founder entrepreneurs achieve growth, earn recognition and build legacy businesses | LinkedIn Top Voice | Ex - Amzn P&G | IIM L | Based in 🇩🇪 & 🇮🇳 supporting clients WW 🌎",
    "about": "Leaders Achieving Personal Growth with 35%+ Hikes. Their Teams Reducing Turnover by 62%. Their Companies Boosting Profits by 30%+: Future/AI-Focused, Human-Centered Leadership\n\nWhat if you, as a leader, had the tools to drive growth and unlock your full potential while empowering your team to do the same? \n\nWith over 20 years of corporate leadership experience and a decade coaching leaders at Amazon, P&G, and Google, I deliver customized coaching solutions that align leadership performance with organizational goals. My neuroscience-backed assessments, proprietary frameworks, and personalized coaching drive results that matter:\n\n✅ 62% reduction in turnover, stabilizing talent pipelines.\n✅ 15-20% improvement in team productivity, enabling smoother operations.\n✅ 30% increases in sales and profitability, aligning leadership growth with financial outcomes.\n✅ 7x ROI on leadership development investments, delivering measurable business impact.\n\nBy combining actionable insights with proven strategies, I help leaders, their teams, and organizations win - empowering human-centred, conscious, and AI-oriented leadership that drives success at every level. Whether scaling, innovating, or driving change, my approach ensures leaders deliver results that resonate across the board.\n\nHow I Help Leaders Like You:\n\n► Scaling Leadership for the Future: Leadership today must meet the demands of AI, hybrid work, and global teams. I help leaders balance short-term pressures with long-term innovation.\n\n► Empowering High-Performing Teams: Using neuroscience-backed assessments, I help teams break silos, foster collaboration, and create psychological safety—a foundation for resilience in the age of AI.\n\n► Driving Measurable Results: My coaching delivers not just inspiration but impact: 15-20% productivity gains, 30% profitability increases, and a 7x ROI on leadership development.\n\n► Human-Centered Leadership for the AI Era: As AI transforms work, leaders must balance technology with human potential. I help you lead with empathy and purpose, ensuring relevance in a world valuing both efficiency and emotional intelligence.\n\nBecause Leadership is More Than a Role. It’s Your Legacy.\n\nIf you’re ready to lead with clarity, confidence, and compassion, let’s connect. Together, we’ll unlock potential - for you, your team, and your organization.\n\n#executivecoaching #leadershipcoaching #futureofwork #AIenhancedLeadership #linkedincreator\n\nAnd yes, I am open to collaborations and brand partnerships. Write to me: meera@meeraremani.com",
    "bannerImageUrl": "https://ik.imagekit.io/amicoder/meeraremani-executivecoach/v1/banner.com_dms_image_v2_D4D16AQEuF9sgXiDuiA_profile-displaybackgroundimage-shrink_350_1400_B4DZolL6n1KUAY-_0_1761560474170",
    "profileImageUrl": "https://ik.imagekit.io/amicoder/meeraremani-executivecoach/v1/profile.com_dms_image_v2_D4D03AQG-Bg3feWuoPQ_profile-displayphoto-shrink_800_800_B4DZR1KG5pG4Ag-_0_1737132372045",
    "scrapedAt": "2025-12-02T04:17:44.937Z"
  }
}
