{
  "v1": {
    "username": "muhammad-ibrahim-website-designer",
    "profileUrl": "https://www.linkedin.com/in/muhammad-ibrahim-website-designer/",
    "fullName": "Muhammad Ibrahim",
    "headline": "Strategic Landing Pages That Make You Look Premium, Sell Better & Stay Top-of-Mind",
    "about": "What if your website's conversion rates doubled?\n\nI've analyzed over 100 websites and discovered a common issue: their conversion rates were alarmingly low.\n\nWhy?\n\nWas it due to their poor design? Hell yes!!!\n\nYou might wonder about the role of design in conversions, but remember, it's the first impression.\n\nIf your website design doesn't hook the visitors, they never scroll. That means no scroll -> no interest in your offer, and that's how your conversion rates drop.\n\nBut fear not, I won't let your conversions stay low and make you feel sad.\n\nHere's how I can help you:\n\nIf you don't have a website yet, congratulations! You're in the right place. I'll craft a website that looks stunning and boost your personal brand, which means more $$$.\n\nOR\n\nIf you have a website but it isn't converting, what's stopping you? I'm here to revamp and optimize it for stellar conversion rates.\n\nAnd \n\nIf you're in need of a landing page to:\n\n- Showcase your Offer\n- Increase Newsletter sign-ups\n- Schedule more appointments through sales pages\n\nSo why wait? Let's create one for you NOW. \n\nEach month I work with 5 Creators/Founders. \n\nAct now before all seats are booked! To do so, simply go to my 'Featured Section' and book a 1:1 discovery call or you can DM me to see if we're good fit.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4D16AQHNoKhXoC9O3A/profile-displaybackgroundimage-shrink_350_1400/B4DZZ8Kik1GwAc-/0/1745839862121?e=1759363200&v=beta&t=F8j5xfDnGuWyzFu690UK7QDuone3CuVP6jnM89EfW5M",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4D03AQErQHz7IT3V-Q/profile-displayphoto-shrink_800_800/B4DZVObCMqHwAc-/0/1740777465505?e=1759363200&v=beta&t=YWlNvpUNAr2Oab3ElD7VfDKP6Vg_ukLUzTgs9cjsldU",
    "scrapedAt": "2025-08-26T00:00:17.673Z"
  }
}