{
  "v1": {
    "username": "nbroekema",
    "profileUrl": "https://www.linkedin.com/in/nbroekema/",
    "fullName": "Nick Broekema",
    "headline": "Content Design that attracts your ideal audience",
    "about": "I ran an agency for 6 years and invisibility nearly killed it (twice).  \n\nWe 100% relied on word-of-mouth marketing:\n\n- Leads from friends and family (not even kidding)\n- Leads from former and current clients\n- Leads through competitors\n\nWe took on what we could get.\n\nSometimes we skyrocketed. Often we struggled.\n\nThe feast and famine cycle was real.\n\nAnd it was painfully frustrating.\n\nAs a business owner, I didn't have:\n\n- Time and focus on growth\n- Time to take care of my team\n- Time to generate leads myself\n\nI was consistently hustling and putting out fires.\n\nWhen I pivoted in 2022, I chose a different strategy:\n\n→ Creating content to build a reputation and presence\n→ Creating content to show the world my offering\n→ Creating content to generate leads every week\n\nAt least, that was the plan.\n\nIt took me months to do it:\n\nI started with text posts. Then I added visuals. Then I added carousels. Then I 'designed' my content. Every upgrade increased my growth and revenue.\n\nThis led me to craft a new solution:\n\nContent Design for LinkedIn. \n\nSince then, I've helped clients build recognizable brands that attract and sell: \n\n- Matt Barker 2X’d his post views, attracted higher paying clients, and 2X’d product sales within 2 months of working together.\n\n- Mollie Cox made $16k (next to her full-time job) within 2 months of working together.\n\n- Pascalle Bergman's revenue went up by 73% after working together.\n\nIf that sounds good, there 3 ways I help founders, CEOs, and creators attract leads on LinkedIn: \n\n1. Content Design done-for-you (ghostwriting + content designs)\n\n2. 1:1 Content Design coaching to attract your ideal audience\n\n3. My first-ever Content Design cohort in September \n\nCheck out my Featured section 💪",
    "bannerImageUrl": "https://ik.imagekit.io/amicoder/nbroekema/v1/banner.com_dms_image_v2_D4E16AQHerrCO7bwAFg_profile-displaybackgroundimage-shrink_350_1400_B4EZp8i32bGUAY-_0_1763026117513",
    "profileImageUrl": "https://ik.imagekit.io/amicoder/nbroekema/v1/profile.com_dms_image_v2_D4E03AQEfW9Z64PpYCQ_profile-displayphoto-shrink_800_800_B4EZYMMoyWHUAg-_0_1743961362827",
    "scrapedAt": "2025-12-02T04:41:47.044Z"
  }
}
