{
  "v1": {
    "username": "osimfavour",
    "profileUrl": "https://www.linkedin.com/in/osimfavour/",
    "fullName": "Favour Osim",
    "headline": "Want to join a community where you can master key React concepts and get hired? Check my featured section | React Developer",
    "about": "If you’re reading this, you're either:\n\n• Stuck watching tutorials without building anything.\n• Frustrated because you don't know where to start.\n• Tired of writing code with AI that you don’t understand.\n• Or you’ve finished learning how to code… but still can’t land a client or job.\n\nYou don’t need to spend months watching tutorials to feel confident as a React developer or struggle alone trying to figure out what comes next.\n\nI help frontend developers escape tutorial hell (+ AI coding confusion), build a well-performing app using React’s component-based architecture, and land their first client →all in just 60 days (or I teach you for free).\n\nHere’s what we’ll achieve together 👇\n\n• Master React’s component-based architecture.\n• Confidently build a fully functional, scalable web app.\n• Think like a developer and write clean, reusable code.\n• Land your first client →GUARANTEED 📌\n\nBy the end, you’ll stop guessing how React works and start thinking like a developer — ready to tackle real-world problems and get paid for it.\n\nWhat’s included:\n• Weekly live calls where I teach and guide you.\n• Recorded step-by-step lessons inside the community.\n• A 30-day implementation challenge to build confidence through action.\n• Direct support + accountability to keep you moving forward.\n\n👉 Everything happens inside my private developer community →built to help you gain clarity, confidence, and community support while mastering React and landing your first client.\n\nYou don’t need another tutorial.\nYou need a plan, a project, and a community that gets you results.\n\nReady to finally master React and land your first client\n\nClick the link in my Featured Section to join the community 🔥",
    "bannerImageUrl": "https://ik.imagekit.io/amicoder/osimfavour/v1/banner.com_dms_image_v2_D4D16AQHIqfBOmx_DuQ_profile-displaybackgroundimage-shrink_350_1400_B4DZqHHhCpKQAc-_0_1763203488554",
    "profileImageUrl": "https://ik.imagekit.io/amicoder/osimfavour/v1/profile.com_dms_image_v2_D4D03AQE4qvaqDcIIHg_profile-displayphoto-shrink_800_800_profile-displayphoto-shrink_800_800_0_1718225193439",
    "scrapedAt": "2025-12-02T04:26:54.784Z"
  }
}
