{
  "v1": {
    "username": "pariscutler",
    "profileUrl": "https://www.linkedin.com/in/pariscutler/",
    "fullName": "Paris Cutler",
    "headline": "The CEO Whisperer | Helping Tech & Manufacturing Leaders Build Bold Visions, Aligned Teams & Sustainable Growth",
    "about": "Most leaders I meet are exhausted. They’re carrying the weight of relentless change, disengaged staff, silos, global competition, and constant firefighting.\n\nI know what that feels like. I’ve built multimillion-dollar businesses, led cultural turnarounds, and consulted across tech, food, and manufacturing. What made the difference every time wasn’t the latest strategy or KPI dashboard. It was vision.\n\nVision changes everything. It gives leaders clarity, energises teams, dissolves silos, and sets the stage for sustainable performance. That’s why today I’m Co-Founder of Positive Leaders Training Company alongside Sandra Duarte. Together we embed the Leader7™ Framework so leaders stop firefighting and start leading.\n\nWHAT WE DO:\n\nWe help CEOs, owners, and leadership teams design bold visions, align their people, and embed the future skills they need to thrive. Our frameworks — Vision7™, Team7™, Skills7™ — are practical, proven, and regenerative. They don’t sit on a shelf. They shift behaviour.\n\nWHO WE WORK WITH:\n\n•\tCEOs & GMs under pressure to deliver in complex markets\n•\tExecutive teams drained by culture and retention issues\n•\tMiddle managers overwhelmed by change and undertraining\n•\tBoards preparing for the next five years of disruption\n\nOur clients include household names, ASX-listed companies, and global brands, as well as ambitious challengers determined to stay ahead.\n\nWHY IT WORKS:\n\nFirefighting keeps you alive. Vision makes you unstoppable.\nWe’ve been CEOs, founders, and consultants. We’ve earned the scars, the wins, and the perspective that only comes from doing the work. Our approach blends bold strategy with people-first leadership, so leaders inspire, teams align, and culture becomes a competitive advantage.\n\nWHAT MAKES US DIFFERENT:\n\n•\tNo corporate theatre. No endless slides.\n•\tYou get us (not juniors), straight talk, and practical tools you can use immediately.\n•\tWe measure what matters: engagement, retention, trust, growth, profit.\n•\tWe only work with a limited number of clients each year so we can stay hands-on.\n\nOUR RESULTS:\n\nLeaders who lead with confidence. Teams who own outcomes. Businesses that grow with clarity and vision.\n\nREADY TO TALK?\n\nIf you’re ready to stop firefighting and start leading with vision, let’s talk. Connect with me here or at www.positiveleaderstraining.com.\n\nWhen leaders rise, everyone rises.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D5616AQGOjSEEI4dkTA/profile-displaybackgroundimage-shrink_350_1400/B56ZkH5jObHAAY-/0/1756774157328?e=1759968000&v=beta&t=fKuizkBHNgG93Bbn5R_HxnuGMYnwbsCRI4QP4INSTt0",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D5603AQH-XR4fesDswg/profile-displayphoto-crop_800_800/B56ZkH5tCTHUAM-/0/1756774192558?e=1759968000&v=beta&t=6x5BM5ou_sNwhAyVpocrCtOm4YMGkwK_Eg7wISatbK8",
    "scrapedAt": "2025-09-03T23:38:50.321Z"
  }
}