{
  "v1": {
    "username": "rehan-sattar",
    "profileUrl": "https://www.linkedin.com/in/rehan-sattar/",
    "fullName": "Rehan Sattar",
    "headline": "Lead Backend Engineer | Top 1% Mentor @Topmate | Author | Tech Speaker",
    "about": "Hey! Thanks for visiting my profile.\n\n\nMy name is Rehan Sattar. A Senior Engineer, Author, Mentor, and Public speaker.\n\nWith over 5 years of hands-on experience in backend engineering.\n\n\nMy journey in tech has been one of continuous learning and relentless curiosity\n\nLeading me from freelancing to full-time engineering roles, where I craft scalable solutions and share knowledge to elevate others in the tech community.\n\n\n🔹 My Professional Snapshot\n\n- Senior Engineer: 5+ years in backend engineering, focused on building resilient, high-performing systems for complex applications.\n\n- Author: Currently writing two books on software engineering, bringing real-world insights to the next generation of developers.\n\n- Mentor: I’ve guided numerous individuals, from budding engineers to career-changers, helping them find their place and thrive in tech.\n\n- Speaker: Engaged audiences across 2 conferences, 5 workshops, 4 meetups, and 2 hackathons, sharing my journey and technical insights.\n\n- Top Rated Freelancer on Upwork: Freelancing taught me the importance of adaptability, delivering excellence for clients worldwide.\n\n\n🛠️ My Tech Stack\n\n- JavaScript & TypeScript: Essential tools in my development toolkit for building robust, interactive applications.\n\n- React, Next.js, Vue.js: My front-end frameworks of choice for delivering seamless user experiences.\n\n- Express & NestJS: My go-to backend frameworks for efficient, scalable APIs.\n\n- MongoDB & PostgreSQL: My database allies, empowering me to manage data precisely and efficiently.\n\n- AWS & Google Cloud: Trusted platforms that help me deploy, scale, and manage infrastructure with ease.\n\n- React Native: Expanding reach to mobile with cross-platform solutions.\n\n\n💡  To me, software engineering is about impact.\n\nEvery project, line of code, or speaking engagement is an opportunity to contribute meaningfully.\n\n\n🌍 I’m open to new opportunities where I can apply my experience, contribute to meaningful projects, and collaborate with passionate teams.\n\nIf you're looking for someone with a strong backend foundation, a mentor’s mindset, and a passion for building impactful solutions, LET'S CONNECT.\n\n📧 Email: rehansattar117@gmail.com\n\nI’m open to work, and I’d love to hear from you!",
    "bannerImageUrl": "https://ik.imagekit.io/amicoder/rehan-sattar/v1/banner.com_dms_image_v2_D4D16AQF-3nvGhp-_fQ_profile-displaybackgroundimage-shrink_350_1400_B4DZkzRXpuGkAY-_0_1757501817652",
    "profileImageUrl": "https://ik.imagekit.io/amicoder/rehan-sattar/v1/profile.com_dms_image_v2_D4D03AQG2Z6kKW-_HAw_profile-displayphoto-shrink_800_800_profile-displayphoto-shrink_800_800_0_1730733381670",
    "scrapedAt": "2025-12-02T04:30:40.940Z"
  }
}
