{
  "v1": {
    "username": "reubenshears",
    "profileUrl": "https://www.linkedin.com/in/reubenshears/",
    "fullName": "Reuben Shears",
    "headline": "2X cash-collected for online service businesses through conversion systems | 100+ founders helped via Optimally | Dual Honours, Astrophysics & Maths BSc",
    "about": "Over the last 2 years, I’ve helped 100+ online service businesses systemise their marketing, scale their client acquisition, and ultimately double their overall cash collected from their sales calls.\n\nMy mission is to help elite agency owners and consultants scale to $100k/month without bottlenecks, burnout, or relying on referrals.\n\nWe build automated client acquisition systems using AI and high-converting funnels - so founders can grow without getting stuck in the grind.\n\nHere’s what I do:\n→ I’m the founder of Optimally, where we install done-for-you growth systems for $10k–$50k/month service businesses.\n→ I help founders generate 5–10+ clients per month using offer calibration, VSL creation and proven landing page funnels\n→ I’ve worked with industry leaders like Liam Evans, Mark Wilson, and Kasey Jones\n→ I’m building a lean 7-figure business that runs on systems\n\nWho we build for:\n→ Agency owners stuck relying on referrals or inconsistent outbound\n→ Coaches + consultants posting content but getting no traction\n→ Service businesses ready to scale without being chained to their marketing\n→ Founders who want leverage, automation, and warm leads - daily\n→ Operators who value precision, speed, and high-performance systems\n\nInstagram: @reubshears\nYouTube: @reubenshears\nLinkedIn: You’re already here. Let’s connect.",
    "bannerImageUrl": "https://ik.imagekit.io/amicoder/reubenshears/v1/banner.com_dms_image_v2_D4E16AQHF44T_kARcAQ_profile-displaybackgroundimage-shrink_350_1400_B4EZp9JAJGIwAY-_0_1763036105154",
    "profileImageUrl": "https://ik.imagekit.io/amicoder/reubenshears/v1/profile.com_dms_image_v2_D4E03AQGKxr9hkTElDA_profile-displayphoto-crop_800_800_B4EZqi94aqIQAI-_0_1763670727397",
    "scrapedAt": "2025-12-02T04:31:02.426Z"
  }
}
