{
  "v1": {
    "username": "reubenshears",
    "profileUrl": "https://www.linkedin.com/in/reubenshears/",
    "fullName": "Reuben Shears",
    "headline": "2X cash-collected for online service businesses through conversion systems | 100+ founders helped via Optimally | Dual Honours, Astrophysics & Maths BSc",
    "about": "Over the last 2 years, I’ve helped 50+ online service businesses systemise their marketing, scale their client acquisition, and reclaim 10+ hours per week — without hiring more team.\n\nMy mission is to help elite agency owners and consultants scale to $100k/month without bottlenecks, burnout, or relying on referrals.\n\nI build automated client acquisition systems using AI, LinkedIn, and high-converting funnels — so founders can grow without getting stuck in the grind. And then build systems to handle those clients as they scale.\n\nHere’s what I do:\n→ I’m the founder of Optimally, where we install done-for-you AI growth systems for $10k–$50k/month agencies\n→ I help founders generate 5–10+ clients per month using automated LinkedIn content, AI engagement, and proven funnels\n→ I remove founders from outreach and content completely — while building their brand and pipeline on autopilot\n→ I’ve worked with leaders like Liam Evans, Mark Wilson, and Kasey Jones\n→ I’m building a lean 7-figure business that runs on systems, not cold DMs or churn-and-burn outreach\n\nWho we build for:\n→ Agency owners stuck relying on referrals or inconsistent outbound\n→ Coaches + consultants posting content but getting no traction\n→ Service businesses ready to scale without being chained to their marketing\n→ Founders who want leverage, automation, and warm leads — daily\n→ Operators who value precision, speed, and high-performance systems\n\nInstagram: @reubshears\nYouTube: @reubenshears\nLinkedIn: You’re already here. Let’s connect.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4E16AQEkTb7mHdVrWQ/profile-displaybackgroundimage-shrink_350_1400/B4EZh6Hyx1HoAc-/0/1754395521466?e=1759363200&v=beta&t=Srx-Mu6GSv1_0WN9Pq6MkxXUx_ALjQPAGs0W7EmxpSg",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4E03AQEtTtZ046YdQA/profile-displayphoto-crop_800_800/B4EZgS_rVIHgAI-/0/1752665343645?e=1759363200&v=beta&t=lz9ci1K1ghwOuceWMJMtHLeZEcXGIjqVaAfwtkbL0B4",
    "scrapedAt": "2025-08-31T12:09:41.893Z"
  }
}