{
  "v1": {
    "username": "rwmackenzie",
    "profileUrl": "https://www.linkedin.com/in/rwmackenzie/",
    "fullName": "Rebecca Mackenzie",
    "headline": "Global Marketing Leader | Founder, The Confident Communication Coach | Ex-Director PMM @ Salesforce | Forbes Coaches Council | Nova Member | PMA Top 100 Product Marketing",
    "about": "I’ve spent 12+ years turning bold ideas into global marketing programs that drive results.\n\nAt Salesforce, I led product marketing strategies for Service Cloud ($8 billion business) across EMEA and globally, launching AI products on international stages, building campaigns that generated over $80M in pipeline, and creating content strategies that scaled across markets and teams. I’ve crafted keynote narratives, shaped product positioning, and built GTM programs that moved the needle (and got people talking).\n\nBut my proudest work? Helping people communicate with confidence.\n\nIn 2024, I launched The Confident Communication Coach, a coaching practice built on everything I learned from pitching to execs, delivering keynotes to 3,000+ attendees, and leading high-stakes launches under pressure. Now I help others speak with authority, tell compelling stories, and lead with presence.\n\nWhether I’m scaling a go-to-market strategy or helping a client prep for the stage, I bring the same approach:\n💡 Clear messaging\n📈 Strategic execution\n💬 And communication that actually connects\n\nI’m currently open to new roles in brand or product marketing leadership, especially ones that value creative thinking, strong storytelling, and cross-functional impact.\n\nAnd I’m always open to coaching partnerships or workshop opportunities.\n\nLet’s connect.\n\n📬 Coaching: theconfidentcommunicationcoach.com\n🌁 Job search: Bay Area, Fall 2025",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4D16AQG9nfZ7N-rUEg/profile-displaybackgroundimage-shrink_350_1400/B4DZel6AILHMAY-/0/1750835136293?e=1759968000&v=beta&t=-CoPASUDV3nFd8v1-VtmPYN4YzYLak5UxoIbiqWa3jc",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4D03AQGWkT0xq5MKuw/profile-displayphoto-crop_800_800/B4DZel6N1wGYAQ-/0/1750835191686?e=1759968000&v=beta&t=Ivvhz4wRzqlhLwTiqNEFWGZNc7X0NxjdDRI2FfyeFxQ",
    "scrapedAt": "2025-09-03T23:55:00.980Z"
  }
}