{
  "v1": {
    "username": "usmans",
    "profileUrl": "https://www.linkedin.com/in/usmans/",
    "fullName": "Usman Sheikh",
    "headline": "Investing in remote-first businesses & agencies | 12 businesses, 2 exits. | Founder of HOV",
    "about": "I never wanted to be an entrepreneur.\n\nGetting fired within 2 weeks of my internship at one of the largest investment banks in the world changed the trajectory of my life. I started my first business with my college roommate in 2003. \n\n21 years later, having started, scaled and sold multiple companies I thank my first manager for firing me everyday. \n\nToday I manage a portfolio of businesses and investments under my personal holding company called High Output Ventures based out of Singapore. \n\nI have a very simple thesis of who I am looking to partner and work with:\n\n‣ Is frustrated at their job or a business they are running\n‣ Has developed a key skillset and has deep expertise in a specific domain\n‣ Wants to start their own business but wants to partner instead of going solo\n‣ Has identified an opportunity in the market which fits their skillset and experience\n‣ Can pick up the phone and get 10 potential prospects on the phone\n‣ Lastly, wants to build the company fully remote\n\nIf the above criteria sounds like you, I hope you will send me a DM!\n\nFor everyone else, I write and share about my journey and am always looking to connect with individuals who share a passion for entrepreneurship and those who have become world class at their craft.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4D16AQFv6OFtMVWm1g/profile-displaybackgroundimage-shrink_350_1400/profile-displaybackgroundimage-shrink_350_1400/0/1718950258237?e=1758758400&v=beta&t=yprk4vLRG-plO5hMqAQBUtOqtnBM66AxuHSFaptZtYw",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4D03AQEZD3zwp8tRxQ/profile-displayphoto-shrink_800_800/profile-displayphoto-shrink_800_800/0/1718950233074?e=1758758400&v=beta&t=QmxgGC7CTgdrki6Sq2xeSCjuDSCIlpR1MrNHTtqY9h8",
    "scrapedAt": "2025-08-25T23:38:52.340Z"
  }
}