{
  "v1": {
    "username": "vadim-soin",
    "profileUrl": "https://www.linkedin.com/in/vadim-soin/",
    "fullName": "Vadim Soin",
    "headline": "Amazon PPC Without Over-reliance on Automation | Few clients, maximum focus | Grow Sales by 30% in the first 4 Weeks On A Pay-On-Results Basis",
    "about": "PPC Jumpstart is a performance-driven Amazon PPC accelerator offering a data-backed, human-managed four-week framework that guarantees a 30%+ increase in revenue - or your money back.\n\nPrecision Targeted Framework™ - a performance-driven PPC program designed for brands doing $1M+ in annual sales.\n\nHere’s how it works:\n\n1) Focused Execution → I only take on a handful of clients at a time, so you get my direct expertise (no interns or middlemen).\n2) Plateau Breaking → Proven campaign structures + placement optimization to unlock new revenue channels and hit record sales months.\n3) Performance Alignment → Pay-on-results model ensures my success is tied to yours.\n4) Fast Impact → Brands typically see measurable profit growth within 30 days.\n\n-----\n\nStarted down the “safe” path as an engineer.\n\nWorked at six different companies, but wanted more — freedom, travel, and control of my time.\nPicked up The 4HWW by Tim F. and started plotting my escape.\n\nBecame a solopreneur — importing from China, running Shopify stores, doing it all myself.\n\nThen found Amazon, launched BEASLY CLAWS (premium weightlifting gear), and scaled it to $200K in sales.\nNo team. No safety net. Just obsession.\n\nToday, I run PPC Jumpstart — a 1-man Amazon PPC service.\n\nI personally manage every account, from $20K/month budgets to multi-million-dollar stores.\n$25M+ in ad sales this year alone.\n\nWhy personal service?\n\nBecause when I was running my own stores, I saw how easy it was to become “just another account” at a big agency.\nI decided I’d never run my business that way.\nMy clients get direct access to me, my full attention, and strategies tailored to their exact goals. \n\nHere's my Precision Targeted Framework:\n\n-Target the right keywords\n-Optimize bids with surgical precision\n-Build campaigns to scale without waste\n\n(No autopilot ads, I keep the robots where they belong: making coffee.)\n\nIf you run an Amazon brand spending $30K+/month, I can show you where the money leaks and where the growth is hiding.\n\nThe best part? If you pass my audit before becoming a client — and most stores don’t — your results are guaranteed.\n\nSend me “AUDIT” for my 10-Step Campaign Audit.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D5616AQF8sX-_EtEJog/profile-displaybackgroundimage-shrink_350_1400/B56ZjomBAoHMAY-/0/1756248938387?e=1759968000&v=beta&t=28XORUnfdnJnl5HdSPrEWFevrA3O91ELmwhr23TNQrY",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D5603AQELcIm83JC0IA/profile-displayphoto-shrink_800_800/profile-displayphoto-shrink_800_800/0/1726547393121?e=1759968000&v=beta&t=oIUWj6U_dNZabXZhyBtLCyJBSur4sjJB9Z4cKF-CYZY",
    "scrapedAt": "2025-09-03T23:41:42.295Z"
  }
}