{
  "v1": {
    "username": "zaman-softaims",
    "profileUrl": "https://www.linkedin.com/in/zaman-softaims/",
    "fullName": "Moeed Zaman",
    "headline": "AI Engineer @Softaims | Built 27+ Custom AI Scalable Solutions | MVPs in Just 6 Weeks | Follow for AI Tips",
    "about": "3.5+ years, 27+ startups, $40M Evaluation.\n\nMy job is simple - build AI systems that don’t just run; they sprint.\n\nLet’s Talk Wins\n\nAlgorithmic trading bots that leverage machine learning to analyze market trends and execute  trades.\n\nComputer vision and facial recognition systems for advanced security and personalization.\n\nEcology modeling to predict and analyze environmental changes and their impact on ecosystems.\n\nAI Calling that handles 80% of queries without breaking a sweat.\n\nDeveloped an anomaly detection system that catches fraud before it bites.\n\nEngineered a recommendation engine that makes users feel like the app reads their minds.\n\nNatural Language Processing (NLP) projects that delve into sentiment analysis, language generation, and conversational AI.\n\nI’m the guy who makes sure the tracks are solid, so we don’t crash when we hit 100 mph.\nAt SoftAims, I’ve worked side-by-side with founders to:\n\n27+ AI models developed, including predictive analytics, natural language processing, and generative AI.\n    •    Launch AI products in as little as 60 days.\n    •    Worked with startup combined valuation around $40 Million\n\nLet’s Get Technical\n\nI’m fluent in Python, TensorFlow, and PyTorch.\n\nNeed an LLM fine-tuned for your niche? I’ve got you.\n\nWant a predictive model that can handle billions of data points? Done that too.\n\nMy toolkit includes everything from Stable Diffusion for creative AI to Kubernetes for deploying models at scale.\n\nBut here’s the thing: Tech is just a tool. The real challenge is making it work in the wild.\n\nThat’s where experience comes in—and trust me, I’ve learned a lot from those “oh no” moments.\nStartups don’t need perfect; they need progress. That’s why I focus on delivering solutions that are:\n\n-Scalable\n-Cost-efficient\n-Impactful\n\nSo, if you’re a founder who’s ready to build something or just someone curious about how AI can integrate in your startup. Let’s chat.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4D16AQGB12isYSvMLg/profile-displaybackgroundimage-shrink_350_1400/profile-displaybackgroundimage-shrink_350_1400/0/1731328601183?e=1758758400&v=beta&t=0i7jWpuO5Kt4LNeRxheasmD69_FT9AQJhy_-N_5ktGc",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4D03AQHV6fuAK75fww/profile-displayphoto-shrink_800_800/profile-displayphoto-shrink_800_800/0/1731332012215?e=1758758400&v=beta&t=h3yeof21ilcGr2DhB5OwyTBmrLxquoC_CjX8cd5sL5Y",
    "scrapedAt": "2025-08-25T14:56:09.001Z"
  }
}