{
  "v1": {
    "username": "zzohaib",
    "profileUrl": "https://www.linkedin.com/in/zzohaib/",
    "fullName": "Muhammad Zohaib",
    "headline": "Turning you into a media company | Clients: 200M+ Impressions per year founder, AI founders, entrepreneurs, and experts| Want to make LinkedIn & X (and emails) - your biggest revenue drivers, DM me.",
    "about": "Over the last 3 years, I’ve worked with world-class founders, entrepreneurs, and experts to build narrative-led brands that move people, not just algorithms. \n\nWe don’t chase content for reach.\n\nWe design content around your belief systems that make you impossible to ignore.\n\nBecause attention fades. Belief compounds.\n\nAnd when your narrative is clear, conviction-led, and category-defining...\n\nThe right people don’t just follow you. They convert. Over and over again.\n\nOur partners work with us across 3 pillars:\n\n1. Narrative-Led Attention - We create DFY content flywheels that:\n\n- Position you as a category owner, not just another “personal brand”\n- Share belief-shifting insights, not recycled threads or surface-level advice\n- Attract qualified ICPs without you spending hours in your inbox or on strategy calls\n\n2. Accelerate Acquisition - Getting right attention is the start. We then:\n\n- Build personalized email marketing systems (not just some common sequences)\n- Craft high-converting funnels tailored to your voice, values, and audience (Done-for-you)\n- Meet your audience exactly where they are with the right offers (imagine if you knew everything about James (subscriber) and sell exactly what he needs)\n\nThis is how we’ve sold $3K masterminds (resulting in 6 figures per launch) and high-ticket services using nothing but content + email (no sales calls)\n\n3. Maximize Ascension - Once we convert your followers into customers, then we help you (DFY):\n\n- Build product ladders and new offers to extend LTV\n- Turn one-time buyers into long-term loyalists\n- Reposition existing products to make them sell better (without changing what’s inside)\n\nRecent Wins (NDA-protected many but happy to share on a call):\n\n- 10M+ targeted impressions/year for myself alone on X and collectively hundreds of millions across clients (no tools/tips/resources or sharing vague broad threads, I HATE THEM)\n\n- Content Strategy partner for a leading personal brand agency serving 8–9 figure founders & entrepeneurs\n\n- Designed + marketed a $997 course from scratch — from content to webinar to email — and helped the client sell out her first cohort.\n\n- Revived a $1,997 high-ticket product for a creator with a “dead” audience → $103,478 in just 4 months across 2 launches only with 4k email list only.\n\n- Repeated 6-figure email launches across courses, masterminds, and 1:1 offers as lead & only email copywriter for an amazing growth marketing agency.\n\nDM “scale” if you’re ready to grow.",
    "bannerImageUrl": "https://media.licdn.com/dms/image/v2/D4D16AQG74IwrpSmcUA/profile-displaybackgroundimage-shrink_350_1400/B4DZfLwcZMGkAc-/0/1751470165273?e=1759968000&v=beta&t=iSulU7ZP6-kyoVAuZ93zcGbF77yf69dkGVbCH-scKE4",
    "profileImageUrl": "https://media.licdn.com/dms/image/v2/D4D03AQHjl-y7w02cig/profile-displayphoto-shrink_800_800/profile-displayphoto-shrink_800_800/0/1711199050111?e=1759968000&v=beta&t=qbnWqz5AATvT0RwV1H6gaTbfnG2fCgr_qrvf5re9meg",
    "scrapedAt": "2025-09-08T01:43:48.643Z"
  }
}